; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 11461)
	(= (fuel plane1) 3980)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city4)
	(= (capacity plane2) 11620)
	(= (fuel plane2) 3941)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 18)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city0)
	(= (capacity plane3) 15173)
	(= (fuel plane3) 1764)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 13)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at plane4 city0)
	(= (capacity plane4) 2816)
	(= (fuel plane4) 378)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 6)
	(at person1 city0)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	(at person5 city0)
	(at person6 city2)
	(at person7 city4)
	(at person8 city2)
	(at person9 city4)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 664)
	(= (distance city0 city2) 890)
	(= (distance city0 city3) 908)
	(= (distance city0 city4) 879)
	(= (distance city1 city0) 664)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 704)
	(= (distance city1 city3) 696)
	(= (distance city1 city4) 981)
	(= (distance city2 city0) 890)
	(= (distance city2 city1) 704)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 948)
	(= (distance city2 city4) 979)
	(= (distance city3 city0) 908)
	(= (distance city3 city1) 696)
	(= (distance city3 city2) 948)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 766)
	(= (distance city4 city0) 879)
	(= (distance city4 city1) 981)
	(= (distance city4 city2) 979)
	(= (distance city4 city3) 766)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane4 city3)
	(at person1 city4)
	(at person2 city1)
	(at person3 city2)
	(at person4 city2)
	(at person5 city4)
	(at person6 city0)
	(at person7 city0)
	(at person8 city0)
	(at person9 city4)
	(at person10 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane4 city0)
   changed: (fuel plane4) from 378 to 2816
   goals met: 3 of 11
2. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 3916, (fuel plane1) from 3980 to 64
   goals met: 3 of 11
3. (board person1 plane4 city0)
   deleted: (at person1 city0)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 3 of 11
4. (board person5 plane4 city0)
   deleted: (at person5 city0)
   added: (in person5 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 3 of 11
5. (zoom plane4 city0 city4)
   deleted: (at plane4 city0)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 3916 to 5674, (fuel plane4) from 2816 to 1058
   goals met: 3 of 11
6. (debark person1 plane4 city4)
   deleted: (in person1 plane4)
   added: (at person1 city4)
   changed: (onboard plane4) from 2 to 1
   goals met: 4 of 11
7. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 11
8. (refuel plane1 city2)
   changed: (fuel plane1) from 64 to 11461
   goals met: 4 of 11
9. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 11
10. (board person7 plane4 city4)
   deleted: (at person7 city4)
   added: (in person7 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 4 of 11
11. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 5674 to 9466, (fuel plane1) from 11461 to 7669
   goals met: 4 of 11
12. (debark person5 plane4 city4)
   deleted: (in person5 plane4)
   added: (at person5 city4)
   changed: (onboard plane4) from 2 to 1
   goals met: 5 of 11
13. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 11
14. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 9466 to 13098, (fuel plane1) from 7669 to 4037
   goals met: 5 of 11
15. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 11
16. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 11
17. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13098 to 16658, (fuel plane1) from 4037 to 477
   goals met: 7 of 11
18. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 11
19. (fly plane4 city4 city0)
   deleted: (at plane4 city4)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 16658 to 17537, (fuel plane4) from 1058 to 179
   goals met: 8 of 11
20. (debark person7 plane4 city0)
   deleted: (in person7 plane4)
   added: (at person7 city0)
   changed: (onboard plane4) from 1 to 0
   goals met: 9 of 11
21. (refuel plane4 city0)
   changed: (fuel plane4) from 179 to 2816
   goals met: 9 of 11
22. (board person10 plane4 city0)
   deleted: (at person10 city0)
   added: (in person10 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 9 of 11
23. (zoom plane4 city0 city4)
   deleted: (at plane4 city0)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 17537 to 19295, (fuel plane4) from 2816 to 1058
   goals met: 9 of 11
24. (debark person10 plane4 city4)
   deleted: (in person10 plane4)
   added: (at person10 city4)
   changed: (onboard plane4) from 1 to 0
   goals met: 10 of 11
25. (fly plane4 city4 city3)
   deleted: (at plane4 city4)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 19295 to 20061, (fuel plane4) from 1058 to 292
   goals met: 11 of 11
